ten = input("nhập tên chủ hộ: ")
a = int(input("chỉ số tháng trước: "))
b = int(input("chỉ số tháng này: "))
c = b - a
if c <= 50:
    T = c*1984
elif 51 <= c <= 100:
    T = 50*1984 + (c - 50)*2050
elif 101 <= c <= 200:
    T = 50*1984 + 2050*50 + (c-100)*2380
elif 201 <= c <= 300:
    T = 50*1984 + 2050*50 + 2380*100 + (c-200)*2998
elif 301 <= c <= 400:
    T = 50*1984 + 2050*50 + 2380*100 + 2998*100 + (c-300)*3350
else:
    T = 50*1984 + 2050*50 + 2380*100 + 2998*100 + 3350*100 + (c-400)*3460
print("họ và tên:", ten)
print("số tiền phải trả là: {:.0f}".format(T*1.08))
